# ----------- დავალება (ლექცია N1) --------------



# 1. დაწერე პროგრამა რომელიც გეკითხება სახელს, გვარს, ასაკს და ქალაქს და ბეჭდავს
# ინფორმაციას შემდეგი სახით:
# (მაგალითი)
# Name: Lia
# Surname: Kebadze
# Age: 20
# City: Tbilisi

#--------------------------------------------------------------------------------------------

# a = input("sheiyvane saxeli: ")
# b = input("sheiyvane gvari: ")
# c = input("sheiyvane asaki: ")
# d = input("sheiyvane sacxovrebeli qalaqi: ")
#
# print(" ")
# print("Name: ", a)
# print("Surname: ", b)
# print("Age: ", c)
# print("City: ", d)

#--------------------------------------------------------------------------------------------

# a = input("sheiyvane saxeli: ")
# b = input("sheiyvane gvari: ")
# c = input("sheiyvane asaki: ")
# d = input("sheiyvane sacxovrebeli qalaqi: ")
#
# print(" ")
# print(f"Name: {a}")
# print(f"Surname: {b}")
# print(f"Age: {c}")
# print(f"City: {d}")

#--------------------------------------------------------------------------------------------



# 2. დაწერე პროგრამა, რომელიც გთხოვს შეიყვანო ნებისმიერი სამი სხვადასხვა ხილის
# დასახელება ცალცალკე. რეზულტატი კი იბეჭდება შემდეგი სახით:
# (მაგალითი)
# Apple//Peach%%Orange

#--------------------------------------------------------------------------------------------

# a = input("sheiyvane xilis dasaxeleba: ")
# b = input("sheiyvane xilis dasaxeleba: ")
# c = input("sheiyvane xilis dasaxeleba: ")
#
# print(" ")
# print(a, "//" , b, "%%", c, sep="")

#--------------------------------------------------------------------------------------------

# a = input("sheiyvane xilis dasaxeleba: ")
# b = input("sheiyvane xilis dasaxeleba: ")
# c = input("sheiyvane xilis dasaxeleba: ")
#
# print(" ")
# print(f"{a}//{b}%%{c}")

#--------------------------------------------------------------------------------------------



# 3. დაწერე პროგრამა, რომელიც გთხოვს შეიყვანო ტექსტი, დათვლის მასში არსებული
# სიმბოლოების რაოდენობას და გამოიტანს შედეგს შემდეგნაირად:
# (მაგალითი)
# Number of symbols: 50

#--------------------------------------------------------------------------------------------

# a = input("sheiyvanet teqsti: ")
# print("Number of symbols: ", len(a))

#--------------------------------------------------------------------------------------------

# a = input("sheiyvanet teqsti: ")
# Length = len(a)
# print("Number of symbols: ", Length)

#--------------------------------------------------------------------------------------------

# print("Number of symbols: ", len(input("sheiyvanet teqsti: ")))

#--------------------------------------------------------------------------------------------



# 4. დაწერე პროგრამა რომელიც გეკითხება ჯერ სახელს, შემდეგ გვარს
# და ინფორმაციის მიღების შემდეგ ტერმინალში ბეჭდავს ერთმანეთის გვერდით.
# (მაგალითი)
# George Abramia

#--------------------------------------------------------------------------------------------

# a = input("sheiyvane saxeli: ")
# b = input("sheiyvane gvari: ")
#
# print(" ")
# print(a, b)

#--------------------------------------------------------------------------------------------

# a = input("sheiyvane saxeli: ")
# b = input("sheiyvane gvari: ")
#
# print(f"{a} {b}")

#--------------------------------------------------------------------------------------------

# print(input("sheiyvane saxeli: "), input("sheiyvane gvari: "))

#--------------------------------------------------------------------------------------------



# 5. დაწერე პროგრამ რომელიც ითხოვს ორ რიცხვს, პირველი რიცხვი
# აჰყავს მეორის ხარისხში და შედეგი იბეჭდება ტერმინალში.

#--------------------------------------------------------------------------------------------

# a = input("sheiyvanet pirveli ricxvi: ")
# b = input("sheiyvanet meore ricxvi: ")
# c = pow(int(a), int(b))
#
# print(c)

#--------------------------------------------------------------------------------------------

# a = int(input("sheiyvanet pirveli ricxvi: "))
# b = int(input("sheiyvanet meore ricxvi: "))
# c = a**b
#
# print(c)

#--------------------------------------------------------------------------------------------

# a = int(input("sheiyvanet pirveli ricxvi: "))
# b = int(input("sheiyvanet meore ricxvi: "))
#
# print(a**b)

#--------------------------------------------------------------------------------------------
