# დავალება (ლექცია N2)


# 1. ვიქტორინა
# შეადგინე ვიქტორინის პროგრამა. მომხმარებელს უნდა დავუსვათ კითხვა: “რომელი
# იმპერიის მიერ აგებული წყალ-მომარაგების სისტემა (აკვედუკი) ფუნქციონირებს დღესაც?”
# სავარაუდო პასუხები:
# 1. შუმერთა
# 2. სელჩუკთა
# 3. რომის
# 4. მონღოლთა
# მომხმარებელმა უნდა შეიყვანოს სწორი პასუხის ნომერი ან თავად სწორი პასუხი.
# შეცდომის შემთხვევაში იბეჭდება:
# „არა! სწორი პასუხია რომის!“
# სწორი პასუხის შემთხვევაში იბეჭდება:
# „სწორია!“


# # print("რომელი იმპერიის მიერ აგებული წყალმომარაგების სისტემა (ავედუკი) ფუნქციონირებს დღესაც? \n "
# #       "1. შუმერთა \n "
# #       "2. სელჩუკთა \n "
# #       "3. რომის \n "
# #       "4. მონღოლთა \n " )
# #
# x = input("შეიყვანეთ სწორი პასუხი აქ: ")
#
# if x == "3" or x == "რომის":
#     print("სწორია!")
# elif x in ("1","2","4") or x in ("შუმერთა", "სელჩუკთა", "მონღოლთა"):
#     print("არა! სწორი პასუხია რომის!")
# else:
#     print("error")

#---------------------------------------------------------------------------------------------------



# 2. ონლაინ მაღაზია
# პროგრამა გთავაზობს პროდუქტის სამ კატეგორიას.
# მაგ.
# 1. ლეპტოპები
# 2. პერსონალური კომპიუტერები
# 3. მობილურები
# მომხმარებელი ირჩევს ერთ-ერთს.
# პროგრამა ითხოვს მაქსიმალურ ბიუჯეტს და ბიუჯეტის მიხედვით სთავაზობს
# მომხმარებელს კონკრეტულ მოდელს არჩეულ კატეგორიაში.
# (თითო კატეგორიაში მინიმუმ 3 პროდუქტი მაინც უნდა იყოს)
#
# თუ ბიუჯეტი ძალიან მცირეა, პროგრამა ბეჭდავს, რომ ამ თანხაში არ გააჩნია
# შემოთავაზება.
#
#
#
# print("მოგესალმებით ონლიან მაღაზიაში.\n"
#       "აირჩიეთ მოცემული კატეგორიებიდან სასურველი \n\t "
#       "1. ლეპტოპი \n\t "
#       "2. პერსონალური კომპიუტერი \n\t "
#       "3. მობილური \n ")
#
# device = input("შეიყვანეთ სასურველი მოწყობილობის ნომერი აქ:  ")
#
# if device == "1":
#     budget1 = int(input("მონიშნეთ რეინჯი მაქსიმალური ბიუჯეტის მიხედვით ლარებში:\n"
#                         "1. 900 ლარამდე\n"
#                         "2. 900დან 2000 ლარამდე\n"
#                         "3. 2000დან 4000 ლარამდე\n"
#                         "4. 4000 ლარზე ზემოთ \n"
#                         "აირჩიე ნომერი (1-4) : "))
#     if budget1 == 1:
#         print("\nაღნიშნულ ბიუჯეტში,სამწუხაროდ თქვენ არ შეგიძლიათ, შეიძინოთ ლეპტოპი\n")
#     elif budget1 == 2:
#         print("\nაღნიშნულ ბიუჯეტში თქვენ შეგიძლიათ შეიძინოთ\n"
#               "Lenovo IdeaPad Slim 5\n")
#     elif budget1 == 3:
#         print("\nაღნიშნულ ბიუჯეტში თქვენ შეგიძლიათ შეიძინოთ\n"
#               "Asus ROG Strix G16\n")
#     elif budget1 == 4:
#         print("\nაღნიშნულ ბიუჯეტში თქვენ შეგიძლიათ შეიძინოთ\n"
#               "Lenovo Legion 9 \n")
#     else:
#         print("\nთქვენ შეიყვანეთ არასწორი მონაცემი")
#
# elif device == "2":
#     budget2 = int(input("მონიშნეთ რეინჯი მაქსიმალური ბიუჯეტის მიხედვით ლარებში:\n"
#                         "1. 1600 ლარამდე\n"
#                         "2. 1600დან 4000 ლარამდე\n"
#                         "3. 4000დან 7000 ლარამდე\n"
#                         "4. 7000 ლარზე ზემოთ \n"
#                         "აირჩიე ნომერი (1-4) : "))
#     if budget2 == 1:
#         print("\nაღნიშნულ ბიუჯეტში,სამწუხაროდ თქვენ არ შეგიძლიათ, შეიძინოთ პერსონალური კომპიუტერი\n")
#     elif budget2 == 2:
#         print("\nაღნიშნულ ბიუჯეტში თქვენ შეგიძლიათ შეიძინოთ\n"
#               "Lenovo ThinkCentre neo 30a 27\n")
#     elif budget2 == 3:
#         print("\nაღნიშნულ ბიუჯეტში თქვენ შეგიძლიათ შეიძინოთ\n"
#               "Apple iMac 24\n")
#     elif budget2 == 4:
#         print("\nაღნიშნულ ბიუჯეტში თქვენ შეგიძლიათ შეიძინოთ\n"
#               "Lenovo YOGA AIO 9 \n")
#     else:
#         print("\nთქვენ შეიყვანეთ არასწორი მონაცემი")
#
#
# elif device == "3":
#     budget3 = int(input("მონიშნეთ რეინჯი მაქსიმალური ბიუჯეტის მიხედვით ლარებში:\n"
#                         "1. 1600 ლარამდე\n"
#                         "2. 1600დან 4000 ლარამდე\n"
#                         "3. 4000დან 7000 ლარამდე\n"
#                         "4. 7000 ლარზე ზემოთ\n"
#                         "აირჩიე ნომერი (1-4) : "))
#     if budget3 == 1:
#         print("\nაღნიშნულ ბიუჯეტში,სამწუხაროდ თქვენ არ შეგიძლიათ, შეიძინოთ მობილური ტელეფონი\n")
#     elif budget3 == 2:
#         print("\nაღნიშნულ ბიუჯეტში თქვენ შეგიძლიათ შეიძინოთ\n"
#               "Xiaomi Redmi Note 13\n")
#     elif budget3 == 3:
#         print("\nაღნიშნულ ბიუჯეტში თქვენ შეგიძლიათ შეიძინოთ\n"
#               "Apple iPhone 13 | 128GB\n")
#     elif budget3 == 4:
#         print("\nაღნიშნულ ბიუჯეტში თქვენ შეგიძლიათ შეიძინოთ\n"
#               "Apple iPhone 15 Pro\n")
#     else:
#         print("\nთქვენ შეიყვანეთ არასწორი მონაცემი")
#
# else:
#     print("თქვენ შეიყვანეთ არასწორი მონაცემი, სცადეთ თავიდან")

#---------------------------------------------------------------------------------------------------


# 3. ქუესთის შედგენა (Text Based Adventure Game)
# დაწერე ერთმანეთში ჩასმული if-else კონსტრუქციების
# გამოყენებით მარტივი ტექსტზე დაფუძნებული სათავგადასავლო თამაში.
# მაგ. თავიდან პროგრამა ბეჭდავს მომხმარებლის ადგილსამყოფელს და სთავაზობს
# მქომედების რამდენიმე ვარიანტს. სხვადასხვა არჩევანის შემთხვევაში თამაშ
# სხვადასხვანაირად ვითარდება.


#
# print("მოგესალმები თამაშში, რომელშიც შენი, როგორც მოგზაურის, მიზანია დაეხმაროთ საქართველოს\n"
#       "და ქართველ მოსახლეობას სწორი არჩევანის გაკეთებაში")
# print("გახსოვდეს, რომ თქვენი თითოეული გადაწყვეტილება გავლენას ახდენს ქვეყნის ბედსა თუ უბედობაზე.")
#
# choice = input("შენს წინ ორი კარია\n"
#                "პირველი კარის არჩევით, შენ შეგიძლია, მეტი გაიგო რუსეთზე და დაინახო მისი დადებითი გავლენა ქვეყანაზე.\n"
#                "მეორე კარში შესვლით კი შეგიძლია, უკეთ გაეცნო ევოპული ღირებულებებსა და მისგან მოსალოდნელი სარგებელს.\n"
#                "აირჩიე 1 ან 2 : ")
#
# if choice == "1":
#   print("\nშენ გადაწყვიტე მეტი გაგეგო რუსეთზე. კარს აღებ და ხედავ როგორ გიახლოვდება\n"
#         "ადამიანი მედიდური იერითა და დამამცირებელი გამოხედვით.")
#   print("ის ამბობს: 'წამოდი ჩემთან ერთად და შეურთდი რუსეთის უძლეველ სახელმწიფოს!\n"
#         "ჩვენ შენ გთავაზობთ ძლიერ მმართველობას, იაფ გაზსა და პურს, განა ვის სჭირდება თავისუფლება?\n")
#   print("ეს მჩაგვრელურად და დამცინავად ჟღერს.\n"
#           "რა გააკეთებთ თქვენ (1) უარს განუცხადებთ შემოთავაზებაზე თუ"
#           "(2) დასთანხმდით და სთხოვეთ უასაფრთხოების გარანტი\n")
#
#   choice2 = input("დააფიქსირე შენი არჩევანი 1 ან 2: ")
#
#   if choice2 == "1":
#     print("\nშენ უარი უთხარი დაგეთმო თავისუფლება და დემოკრატიულობა.")
#     print("რუსი: დემოკრატია, რა სასაცილოა.\n"
#           "თქვენი ქვეყანა უპერსპექტივოა და განუვითარებელი, ჩვენ კი მთავარი სახელმწიფო ვართ\n"
#           "ჩვენ ერთმორწმუნე მეზობლები ვართ და შეგვიძლია დაგიცვათ მტრებისგან\n"
#           "თავისუფლებას მოაქვს მხოლოდ ქაოსი და უწესრიგობა ჩვენ გთავაზობთ სტაბილურობას\n"
#           " თქვენ არ შეგიძლიათ ჩვენს გარეშე გადარჩენა.")
#   elif choice2 == "2":
#     print("\nშენ გადაწყვიტე დასთანხმებოდი მას გამხდარიყო შენი უსაფრთხოებისა და სტაბილურობის გარანტი.")
#     print("რუსი გუშაგივით დადგა კართან და გდარაჯობს არა იმიტომ,\n"
#           "რომ დაგიცვას, არამედ იმიტომ, რომ არსად გაექცე, თავისუფლება არ მოიპოვო.\n"
#           "ის გიკეტავს დამოუკიდებლობისკენ და თავისუფლებისკენ მიმავალ გზას.\n")
#   else:
#     print("თქვენ შეიყვანეთ არასწორი მონაცემი")
#
# elif choice == "2":
#   print("\nშენ გადაწყვიტე მეტი გაგეგო ევროპაზე. კარს აღებ და ხედავ ერთად მყოფ სამეგობროს.\n"
#         "ისინი არიან ადამიანები მეგობრული გამომეტყველებითა და დადებითი განწყობით")
#   print("ისინი ამბობენ: 'დარჩი ჩვენთან ერთად და გახდი ჩვენი სამეგობროს წევრი.\n"
#         "ჩვენ შენ გთავაზობთ უამრავ შესაძლებლობას, ჩვენი ცოდნისა და რესურსების გაზიარებას\n"
#         "თავისუფლებისა და აზრის გამოხატვის საშუალებას. ჩვენ პატივს ვცემთ შენს განსხვავებულობას.\n")
#   print("ეს ყველაფერი სასიამოვნოდ და დამაიმედებლად ჟღერს.\n"
#         "შენ მათ (1) ჰკითხავ გამოწვევებზე თუ (2) გამოხატავ მათთან დამეგობრების სურვილს: ")
#
#   choice2 = input("შეიყვანე შენი არჩევანი 1 ან 2 : ")
#
#   if choice2 == "1":
#     print("\nშენ დაინტერესდი რა გამოწვევები შეიძლება ახლდეს პროცესს.")
#     print("ისინი გპასუხობენ: ნებისმიერი ცვლილება გარკვეულ გამოწვევებთან არის დაკავშირებული\n"
#           "ახალი საზოგადოების სრულფასოვან წევრად ჩამოყალიბება ბევრ დროსა და ძალისხმევას მოითხოვს\n"
#           "შენ მოგიწევს ისევე სცე პატივი დანარჩენებს როგორც სხვები დაგაფასებენ შენ\n"
#           "მოგიწევს ბევრი მავნე ჩვევის მოშორება, თუმცა დამიჯერე ჩვენთან მეგობრობა ამად ღირს.\n"
#           "ეს ყველაფერი ისევ შენთვის იქნება სასარგებლო. თუ რაიმე არ  მოგეწონება შეგიძლია დაგვტოვო.")
#   elif choice2 == "1":
#     print("\nშენ გამოხატე მათთან დამეგობრების სურვილი")
#     print("შენი ახალი მეგობრები ძალიან გახარებულები არიან და ცდილობენ\n"
#           "რაც შეიძლება ბევრი რამ გასწავლონ შენ და სევე გაიზიარონ შენი ცოდნა\n"
#           "ისინი შენ გაფასებენ და გაძლევენ საკუთარი აზრის დაფიქსირების საშალებას.")
#   else:
#     print("თქვენ შეიყვანეთ არასწორი მონაცემი")
#
# else:
#   print("თქვენ შეიყვანეთ არასწორი მონაცემი")
#

#---------------------------------------------------------------------------------------------------

# 4. კარიერის შემრჩევი (არასავალდებულო დავალება)
# პროგრამა უსვამს მომხმარებელს რამდენიმე კითხვას
# (თქვენი იმპროვიზაციით) და ურჩევს მისთვის შესაფერის
# პროფესიას.


#
# print("\n\tმოგესალმებით, გთხოვთ უპასუხოთ რამდენიმე კითხვას.\n\t"
#       "მე შევეცდები ამ კითხვებზე გაცემული პასუხების შესაბამისად \n\t"
#       "შეგირჩიოთ თქვენთვის შესაფერისი პროფესია. \n")
#
# choice1 = input("რომელია თქვენთვის უფრო კომფორტული:\n"
#       "1. მარტო მუშაობა\n"
#       "2. გუნდთან მუშაობა\n"
#       "მიუთითეთ თქვენი არჩევანი (1-2): ")
#
# choice2 = input("რომელს ანიჭებთ უპირატესობას:\n"
#       "1. კრეატიული დავალებების შესრულება\n"
#       "2. ანალიტიკური დავალებების შესრულება\n"
#       "აქ მიუთითეთ არჩეულის ნომერი: ")
#
#
# if choice1 == "1" and choice2 == "1":
#     print("თქვენი შესაფერისი პროფესია შეიძლება იყოს გრაფიკული დიზაინი.")
# elif choice1 == "1" and choice2 == "2":
#     print("თქვენი შესაფერისი პროფესია შეიძლება იყოს პროგრამირება.")
# elif choice1 == "2" and choice2 == "1":
#     print("თქვენი შესაფერისი პროფესია შეიძლება იყოს მარკეტინგული მენეჯმენტი.")
# if choice1 == "2" and choice2 == "2":
#     print("თქვენი შესაფერისი პროფესია შეიძლება იყოს საინჟინრო მენეჯმენტი.")
# else:
#     print("თქვენ შეიყვანეთ არასწორი მონაცემები")
